Nucleate_boiling/0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           uniform (0 0 0);
    }

    // fluid_to_solid
    // {
    //     type noSlip;
    // }

    bottom
    {
        type            noSlip;
    }
  right
  {
    type zeroGradient;
  }
  front
  {
    type wedge;
  }
  back
  {
    type wedge;
  }
  axis
  {
    type empty;
  }

}

// ************************************************************************* //
