Nucleate_boiling/0.orig/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
  top
  {
      type            zeroGradient;
  }

  // fluid_to_solid
  // {
  //     type fixedFluxPressure;
  // }

  bottom
  {
      type fixedFluxPressure;
  }
  right
  {
    type fixedFluxPressure;
  }
  front
  {
    type wedge;
  }
  back
  {
    type wedge;
  }

  axis
  {
    type empty;
  }


}

// ************************************************************************* //
