Nucleate_boiling/0.orig/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 373.15;

boundaryField
{
    top
    {
        type            zeroGradient;
    }

    // fluid_to_solid
    // {
    //     type            compressible::turbulentTemperatureRadCoupledMixed;
    //     value           $internalField;
    //     Tnbr            T;
    //     kappaMethod     fluidThermo;
    //     qrNbr           none;
    //     qr              none;
    //     kappa           none;
    // }
    bottom
    {
        type            zeroGradient;
    }
        
  right
  {
    type zeroGradient;
  }
  front
  {
    type wedge;
  }
  back
  {
    type wedge;
  }
  axis
  {
    type empty;
  }
}

// ************************************************************************* //
