Nucleate_boiling/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    // pointCellsLeastSquares; seems to fail
    //default         cellLimited Gauss linear 1;//
    default           cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss vanLeer;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;


    // div(phi,U)      Gauss upwind;
    div(rhoPhi,U)      Gauss limitedLinearV 1;
    // div(phi,K)      Gauss linear;
    // div(phi,h)      Gauss upwind;
    // div(phi,k)      Gauss upwind;
    // div(phi,epsilon) Gauss upwind;
    // div(phi,R)      Gauss upwind;
    // div(R)          Gauss linear;
    // div(((rho*nuEff)*dev2(T(grad(U))))) Gauss upwind;
    // div(phiv,p)     Gauss linear;
    // div(phi,e)      Gauss upwind;
    div(rhoCpLPhi,T.water) Gauss limitedLinear 1;
    div(rhoCpVPhi,T.air) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default        Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    p_rgh;
    alpha.water;
}

// ************************************************************************* //
