Nucleate_boiling/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    //default         cellLimited Gauss upwind 1;
    default           Gauss upwind phi;
}

divSchemes
{
    default  none;
    // div(phi,alpha)  Gauss limitedLinear 1;
    // div(phirb,alpha) Gauss limitedLinear 1;

    // div(rhoPhi,U)  Gauss upwind;
    // div(phi,thermo:rho.water) Gauss upwind;
    // div(phi,thermo:rho.air) Gauss upwind;
    // div(rhoPhi,T)  Gauss upwind;
    // div(rhoPhi,K)  Gauss upwind;
    // div(phi,p)      Gauss upwind;
    // div(phi,k)      Gauss upwind;

    // div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

// ************************************************************************* //
